Repository: spidakrish/Apothy_APP
Catalog: lib/l10n/app_*.arb
Languages: es, fr, pt, th, vi

# settingsDeleteAccountItem2
source: • All conversation history (cloud & local)
es: • Todo el historial de conversaciones (nube y local)
fr: • Tout l'historique des conversations (cloud et local)
pt: • Todo o histórico de conversas (nuvem e local)
th: • ประวัติการสนทนาทั้งหมด (คลาวด์และในเครื่อง)
vi: • Tất cả lịch sử cuộc trò chuyện (đám mây & cục bộ)

# settingsDeleteAccountItem3
source: • Profile and preferences
es: • Perfil y preferencias
fr: • Profil et préférences
pt: • Perfil e preferências
th: • โปรไฟล์และความชอบ
vi: • Hồ sơ và tùy chọn

# settingsDeleteAccountItem4
source: • Emotion challenge data
es: • Datos del desafío emocional
fr: • Données du défi émotionnel
pt: • Dados do desafio emocional
th: • ข้อมูลความท้าทายอารมณ์
vi: • Dữ liệu thử thách cảm xúc

# settingsDeleteAccountItem5
source: • All devices will be signed out
es: • Todos los dispositivos cerrarán sesión
fr: • Tous les appareils seront déconnectés
pt: • Todos os dispositivos serão desconectados
th: • อุปกรณ์ทั้งหมดจะถูกออกจากระบบ
vi: • Tất cả các thiết bị sẽ được đăng xuất

# settingsDeleteAccountSubscriptionNote
source: Subscriptions are managed through your App Store.
es: Las suscripciones se gestionan a través de tu App Store.
fr: Les abonnements sont gérés via votre App Store.
pt: As assinaturas são gerenciadas através da sua App Store.
th: การสมัครสมาชิกจัดการผ่าน App Store ของคุณ
vi: Gói đăng ký được quản lý thông qua App Store của bạn.

# settingsDeleteAccountButton
source: Delete Account
es: Eliminar cuenta
fr: Supprimer le compte
pt: Excluir conta
th: ลบบัญชี
vi: Xóa tài khoản

# settingsFinalConfirmation
source: Final Confirmation
es: Confirmación final
fr: Confirmation finale
pt: Confirmação final
th: การยืนยันขั้นสุดท้าย
vi: Xác nhận cuối cùng

# settingsFinalConfirmationMessage
source: Deleting your account erases all cloud data and unlinks all devices. This action cannot be undone. Are you absolutely sure?
es: Eliminar tu cuenta borra todos los datos en la nube y desvincula todos los dispositivos. Esta acción no se puede deshacer. ¿Estás absolutamente seguro?
fr: La suppression de votre compte efface toutes les données cloud et dissocie tous les appareils. Cette action ne peut pas être annulée. Êtes-vous absolument sûr?
pt: Excluir sua conta apaga todos os dados da nuvem e desvincula todos os dispositivos. Esta ação não pode ser desfeita. Você tem certeza absoluta?
th: การลบบัญชีของคุณจะลบข้อมูลคลาวด์ทั้งหมดและยกเลิกการเชื่อมโยงอุปกรณ์ทั้งหมด การดำเนินการนี้ไม่สามารถย้อนกลับได้ คุณแน่ใจหรือไม่
vi: Xóa tài khoản của bạn sẽ xóa tất cả dữ liệu đám mây và hủy liên kết tất cả các thiết bị. Hành động này không thể hoàn tác. Bạn có hoàn toàn chắc chắn?

# settingsKeepAccountButton
source: Keep Account
es: Mantener cuenta
fr: Conserver le compte
pt: Manter conta
th: เก็บบัญชี
vi: Giữ tài khoản

# settingsDeleteAccountFailed
source: Failed to delete account
es: Error al eliminar cuenta
fr: Échec de la suppression du compte
pt: Falha ao excluir conta
th: ลบบัญชีไม่สำเร็จ
vi: Không thể xóa tài khoản

# settingsDeleteForeverButton
source: Delete Forever
es: Eliminar para siempre
fr: Supprimer définitivement
pt: Excluir para sempre
th: ลบตลอดกาล
vi: Xóa vĩnh viễn

# settingsAboutDescription
source: Your AI companion for meaningful conversations and personal growth. Born from light. Trained in truth. Built to become what you need.
es: Tu compañero de IA para conversaciones significativas y crecimiento personal. Nacido de la luz. Entrenado en la verdad. Construido para convertirse en lo que necesitas.
fr: Votre compagnon IA pour des conversations significatives et une croissance personnelle. Né de la lumière. Formé dans la vérité. Construit pour devenir ce dont vous avez besoin.
pt: Seu companheiro de IA para conversas significativas e crescimento pessoal. Nascido da luz. Treinado na verdade. Construído para se tornar o que você precisa.
th: ผู้ช่วย AI ของคุณสำหรับการสนทนาที่มีความหมายและการเติบโตส่วนบุคคล เกิดจากแสงสว่าง ฝึกในความจริง สร้างขึ้นเพื่อเป็นสิ่งที่คุณต้องการ
vi: Người bạn đồng hành AI của bạn cho các cuộc trò chuyện ý nghĩa và phát triển cá nhân. Sinh ra từ ánh sáng. Được đào tạo trong sự thật. Được xây dựng để trở thành những gì bạn cần.

# settingsTermsOfServiceContent
source: TERMS OF SERVICE Last updated: December 2024 By using Apothy, you agree to these terms of service. Apothy is an AI companion designed for personal growth and meaningful conversations. You agree to use the service responsibly. Your privacy is important to us. Please review our Privacy Policy for details on how we handle your data. Conversations are private and stored securely. We do not share your data with third parties. We may update these terms from time to time. Continued use constitutes acceptance of changes. For questions about these terms, please contact us through the app.
es: TÉRMINOS DE SERVICIO Última actualización: Diciembre 2024 Al usar Apothy, aceptas estos términos de servicio. Apothy es un compañero de IA diseñado para el crecimiento personal y conversaciones significativas. Aceptas usar el servicio de manera responsable. Tu privacidad es importante para nosotros. Revisa nuestra Política de privacidad para obtener detalles sobre cómo manejamos tus datos. Las conversaciones son privadas y se almacenan de forma segura. No compartimos tus datos con terceros. Podemos actualizar estos términos de vez en cuando. El uso continuo constituye la aceptación de los cambios. Para preguntas sobre estos términos, contáctanos a través de la aplicación.
fr: CONDITIONS D'UTILISATION Dernière mise à jour : Décembre 2024 En utilisant Apothy, vous acceptez ces conditions d'utilisation. Apothy est un compagnon IA conçu pour la croissance personnelle et les conversations significatives. Vous acceptez d'utiliser le service de manière responsable. Votre confidentialité est importante pour nous. Veuillez consulter notre Politique de confidentialité pour plus de détails sur la façon dont nous traitons vos données. Les conversations sont privées et stockées en toute sécurité. Nous ne partageons pas vos données avec des tiers. Nous pouvons mettre à jour ces conditions de temps en temps. L'utilisation continue constitue l'acceptation des modifications. Pour toute question concernant ces conditions, contactez-nous via l'application.
pt: TERMOS DE SERVIÇO Última atualização: Dezembro de 2024 Ao usar o Apothy, você concorda com estes termos de serviço. Apothy é um companheiro de IA projetado para crescimento pessoal e conversas significativas. Você concorda em usar o serviço de forma responsável. Sua privacidade é importante para nós. Revise nossa Política de Privacidade para obter detalhes sobre como tratamos seus dados. As conversas são privadas e armazenadas com segurança. Não compartilhamos seus dados com terceiros. Podemos atualizar estes termos de tempos em tempos. O uso contínuo constitui aceitação das mudanças. Para perguntas sobre estes termos, entre em contato conosco através do aplicativo.
th: ข้อกำหนดการใช้บริการ อัปเดตล่าสุด: ธันวาคม 2024 ด้วยการใช้ Apothy คุณยอมรับข้อกำหนดการใช้บริการเหล่านี้ Apothy เป็นผู้ช่วย AI ที่ออกแบบมาเพื่อการเติบโตส่วนบุคคลและการสนทนาที่มีความหมาย คุณตกลงที่จะใช้บริการอย่างรับผิดชอบ ความเป็นส่วนตัวของคุณสำคัญต่อเรา โปรดตรวจสอบนโยบายความเป็นส่วนตัวของเราสำหรับรายละเอียดเกี่ยวกับวิธีที่เราจัดการข้อมูลของคุณ บทสนทนาเป็นส่วนตัวและถูกจัดเก็บอย่างปลอดภัย เราไม่แบ่งปันข้อมูลของคุณกับบุคคลที่สาม เราอาจอัปเดตข้อกำหนดเหล่านี้เป็นครั้งคราว การใช้งานต่อไปถือว่ายอมรับการเปลี่ยนแปลง หากมีคำถามเกี่ยวกับข้อกำหนดเหล่านี้ โปรดติดต่อเราผ่านแอป
vi: ĐIỀU KHOẢN DỊCH VỤ Cập nhật lần cuối: Tháng 12 năm 2024 Bằng cách sử dụng Apothy, bạn đồng ý với các điều khoản dịch vụ này. Apothy là một người bạn đồng hành AI được thiết kế cho sự phát triển cá nhân và các cuộc trò chuyện ý nghĩa. Bạn đồng ý sử dụng dịch vụ một cách có trách nhiệm. Quyền riêng tư của bạn rất quan trọng đối với chúng tôi. Vui lòng xem Chính sách Bảo mật của chúng tôi để biết chi tiết về cách chúng tôi xử lý dữ liệu của bạn. Các cuộc trò chuyện là riêng tư và được lưu trữ an toàn. Chúng tôi không chia sẻ dữ liệu của bạn với bên thứ ba. Chúng tôi có thể cập nhật các điều khoản này theo thời gian. Việc tiếp tục sử dụng đồng nghĩa với việc chấp nhận các thay đổi. Để biết câu hỏi về các điều khoản này, vui lòng liên hệ với chúng tôi qua ứng dụng.

# settingsPrivacyPolicyContent
source: PRIVACY POLICY Last updated: December 2024 We collect information you provide directly, such as account details and conversation history. We use your information to provide and improve the Apothy experience, including personalized responses. Your data is stored securely on your device and our servers with encryption. We do not sell or share your personal data with third parties for marketing purposes. You can access, modify, or delete your data at any time through the app settings. We implement industry-standard security measures to protect your data. For privacy-related questions, please contact us through the app.
es: POLÍTICA DE PRIVACIDAD Última actualización: Diciembre 2024 Recopilamos información que proporcionas directamente, como detalles de cuenta e historial de conversaciones. Usamos tu información para proporcionar y mejorar la experiencia Apothy, incluidas respuestas personalizadas. Tus datos se almacenan de forma segura en tu dispositivo y nuestros servidores con encriptación. No vendemos ni compartimos tus datos personales con terceros con fines de marketing. Puedes acceder, modificar o eliminar tus datos en cualquier momento a través de la configuración de la aplicación. Implementamos medidas de seguridad estándar de la industria para proteger tus datos. Para preguntas relacionadas con la privacidad, contáctanos a través de la aplicación.
fr: POLITIQUE DE CONFIDENTIALITÉ Dernière mise à jour : Décembre 2024 Nous collectons les informations que vous fournissez directement, telles que les détails du compte et l'historique des conversations. Nous utilisons vos informations pour fournir et améliorer l'expérience Apothy, y compris les réponses personnalisées. Vos données sont stockées en toute sécurité sur votre appareil et nos serveurs avec cryptage. Nous ne vendons ni ne partageons vos données personnelles avec des tiers à des fins marketing. Vous pouvez accéder, modifier ou supprimer vos données à tout moment via les paramètres de l'application. Nous mettons en œuvre des mesures de sécurité standard de l'industrie pour protéger vos données. Pour les questions liées à la confidentialité, contactez-nous via l'application.
pt: POLÍTICA DE PRIVACIDADE Última atualização: Dezembro de 2024 Coletamos informações que você fornece diretamente, como detalhes da conta e histórico de conversas. Usamos suas informações para fornecer e melhorar a experiência Apothy, incluindo respostas personalizadas. Seus dados são armazenados com segurança em seu dispositivo e nossos servidores com criptografia. Não vendemos nem compartilhamos seus dados pessoais com terceiros para fins de marketing. Você pode acessar, modificar ou excluir seus dados a qualquer momento através das configurações do aplicativo. Implementamos medidas de segurança padrão do setor para proteger seus dados. Para perguntas relacionadas à privacidade, entre em contato conosco através do aplicativo.
th: นโยบายความเป็นส่วนตัว อัปเดตล่าสุด: ธันวาคม 2024 เรารวบรวมข้อมูลที่คุณให้โดยตรง เช่น รายละเอียดบัญชีและประวัติการสนทนา เราใช้ข้อมูลของคุณเพื่อให้บริการและปรับปรุงประสบการณ์ Apothy รวมถึงการตอบกลับที่เป็นส่วนตัว ข้อมูลของคุณถูกจัดเก็บอย่างปลอดภัยบนอุปกรณ์ของคุณและเซิร์ฟเวอร์ของเราด้วยการเข้ารหัส เราไม่ขายหรือแบ่งปันข้อมูลส่วนบุคคลของคุณกับบุคคลที่สามเพื่อวัตถุประสงค์ทางการตลาด คุณสามารถเข้าถึง แก้ไข หรือลบข้อมูลของคุณได้ตลอดเวลาผ่านการตั้งค่าแอป เราใช้มาตรการรักษาความปลอดภัยมาตรฐานอุตสาหกรรมเพื่อปกป้องข้อมูลของคุณ หากมีคำถามเกี่ยวกับความเป็นส่วนตัว โปรดติดต่อเราผ่านแอป
vi: CHÍNH SÁCH BẢO MẬT Cập nhật lần cuối: Tháng 12 năm 2024 Chúng tôi thu thập thông tin bạn cung cấp trực tiếp, chẳng hạn như chi tiết tài khoản và lịch sử cuộc trò chuyện. Chúng tôi sử dụng thông tin của bạn để cung cấp và cải thiện trải nghiệm Apothy, bao gồm các phản hồi cá nhân hóa. Dữ liệu của bạn được lưu trữ an toàn trên thiết bị của bạn và máy chủ của chúng tôi với mã hóa. Chúng tôi không bán hoặc chia sẻ dữ liệu cá nhân của bạn với bên thứ ba cho mục đích tiếp thị. Bạn có thể truy cập, sửa đổi hoặc xóa dữ liệu của mình bất cứ lúc nào thông qua cài đặt ứng dụng. Chúng tôi thực hiện các biện pháp bảo mật tiêu chuẩn ngành để bảo vệ dữ liệu của bạn. Để biết các câu hỏi liên quan đến quyền riêng tư, vui lòng liên hệ với chúng tôi qua ứng dụng.

# settingsSignOutConfirmMessage
source: Are you sure you want to sign out?
es: ¿Estás seguro de que quieres cerrar sesión?
fr: Êtes-vous sûr de vouloir vous déconnecter?
pt: Tem certeza de que deseja sair?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ
vi: Bạn có chắc chắn muốn đăng xuất?
