Repository: spidakrish/Apothy_APP
Catalog: lib/l10n/app_*.arb
Languages: es, fr, pt, th, vi

source: OK
th: ตกลง

source: Cancel
es: Cancelar
fr: Annuler
pt: Cancelar
th: ยกเลิก
vi: Hủy

# continueButton
source: Continue
es: Continuar
fr: Continuer
pt: Continuar
th: ดำเนินการต่อ
vi: Tiếp tục

source: Save
es: Guardar
fr: Enregistrer
pt: Salvar
th: บันทึก
vi: Lưu

source: Delete
es: Eliminar
fr: Supprimer
pt: Excluir
th: ลบ
vi: Xóa

source: Loading...
es: Cargando...
fr: Chargement...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...

source: Error
fr: Erreur
pt: Erro
th: ข้อผิดพลาด
vi: Lỗi

source: Retry
es: Reintentar
fr: Réessayer
pt: Tentar novamente
th: ลองอีกครั้ง
vi: Thử lại

source: Close
es: Cerrar
fr: Fermer
pt: Fechar
th: ปิด
vi: Đóng

# settingsTitle
source: Settings
es: Configuración
fr: Paramètres
pt: Configurações
th: การตั้งค่า
vi: Cài đặt

# settingsProfile
source: Profile
es: Perfil
fr: Profil
pt: Perfil
th: โปรไฟล์
vi: Hồ sơ

# settingsAccount
source: Account
es: Cuenta
fr: Compte
pt: Conta
th: บัญชี
vi: Tài khoản

# settingsNotSignedIn
source: Not signed in
es: No has iniciado sesión
fr: Non connecté
pt: Não conectado
th: ยังไม่ได้เข้าสู่ระบบ
vi: Chưa đăng nhập

# settingsNotifications
source: Notifications
es: Notificaciones
pt: Notificações
th: การแจ้งเตือน
vi: Thông báo

# settingsManageNotifications
source: Manage Notifications
es: Gestionar notificaciones
fr: Gérer les notifications
pt: Gerenciar notificações
th: จัดการการแจ้งเตือน
vi: Quản lý thông báo

# settingsNotificationsCount
source: {count} of 4 enabled
es: {count} de 4 activadas
fr: {count} sur 4 activées
pt: {count} de 4 ativadas
th: เปิดใช้งาน {count} จาก 4 รายการ
vi: {count} trong số 4 đã bật

# settingsAppearance
source: Appearance
es: Apariencia
fr: Apparence
pt: Aparência
th: รูปลักษณ์
vi: Giao diện

# settingsTheme
source: Theme
es: Tema
fr: Thème
pt: Tema
th: ธีม
vi: Chủ đề

# settingsDarkMode
source: Dark mode
es: Modo oscuro
fr: Mode sombre
pt: Modo escuro
th: โหมดมืด
vi: Chế độ tối

# settingsTextSize
source: Text Size
es: Tamaño de texto
fr: Taille du texte
pt: Tamanho do texto
th: ขนาดตัวอักษร
vi: Kích thước chữ

# settingsLanguage
source: Language
es: Idioma
fr: Langue
pt: Idioma
th: ภาษา
vi: Ngôn ngữ

# settingsContent
source: Content
es: Contenido
fr: Contenu
pt: Conteúdo
th: เนื้อหา
vi: Nội dung

# settingsContentPreferences
source: Content Preferences
es: Preferencias de contenido
fr: Préférences de contenu
pt: Preferências de conteúdo
th: การตั้งค่าเนื้อหา
vi: Tùy chọn nội dung

# settingsData
source: Data
es: Datos
fr: Données
pt: Dados
th: ข้อมูล
vi: Dữ liệu

# settingsClearChatHistory
source: Clear Chat History
es: Borrar historial de chat
fr: Effacer l'historique des conversations
pt: Limpar histórico de conversas
th: ล้างประวัติการสนทนา
vi: Xóa lịch sử trò chuyện

# settingsClearChatHistorySubtitle
source: Delete conversations and memory
es: Eliminar conversaciones y memoria
fr: Supprimer les conversations et la mémoire
pt: Excluir conversas e memória
th: ลบบทสนทนาและความทรงจำ
vi: Xóa cuộc trò chuyện và bộ nhớ

# settingsAdvanced
source: Advanced
es: Avanzado
fr: Avancé
pt: Avançado
th: ขั้นสูง
vi: Nâng cao

# settingsAdvancedSubtitle
source: Reset app to fresh state
es: Restablecer la aplicación
fr: Réinitialiser l'application
pt: Redefinir o aplicativo
th: รีเซ็ตแอปให้เป็นค่าเริ่มต้น
vi: Đặt lại ứng dụng

# settingsPrivacy
source: Privacy
es: Privacidad
fr: Confidentialité
pt: Privacidade
th: ความเป็นส่วนตัว
vi: Quyền riêng tư

# settingsDataPrivacy
source: Data Privacy
es: Privacidad de datos
fr: Confidentialité des données
pt: Privacidade de dados
th: ความเป็นส่วนตัวของข้อมูล
vi: Quyền riêng tư dữ liệu

# settingsDataPrivacySubtitle
source: How your data is handled
es: Cómo se manejan tus datos
fr: Comment vos données sont traitées
pt: Como seus dados são tratados
th: วิธีจัดการข้อมูลของคุณ
vi: Cách dữ liệu của bạn được xử lý

# settingsDangerZone
source: Danger Zone
es: Zona peligrosa
fr: Zone dangereuse
pt: Zona de perigo
th: โซนอันตราย
vi: Vùng nguy hiểm

# settingsDeleteAccount
source: Delete Account
es: Eliminar cuenta
fr: Supprimer le compte
pt: Excluir conta
th: ลบบัญชี
vi: Xóa tài khoản

# settingsDeleteAccountSubtitle
source: Permanently delete your account
es: Eliminar permanentemente tu cuenta
fr: Supprimer définitivement votre compte
pt: Excluir permanentemente sua conta
th: ลบบัญชีของคุณอย่างถาวร
vi: Xóa vĩnh viễn tài khoản của bạn

# settingsAbout
source: About
es: Acerca de
fr: À propos
pt: Sobre
th: เกี่ยวกับ
vi: Giới thiệu

# settingsAboutApothy
source: About Apothy
es: Acerca de Apothy
fr: À propos d'Apothy
pt: Sobre o Apothy
th: เกี่ยวกับ Apothy
vi: Giới thiệu về Apothy

# settingsVersion
source: Version 1.0.0
es: Versión 1.0.0
pt: Versão 1.0.0
th: เวอร์ชัน 1.0.0
vi: Phiên bản 1.0.0

# settingsTermsOfService
source: Terms of Service
es: Términos de servicio
fr: Conditions d'utilisation
pt: Termos de serviço
th: ข้อกำหนดการใช้บริการ
vi: Điều khoản dịch vụ

# settingsTermsSubtitle
source: Read our terms
es: Lee nuestros términos
fr: Lire nos conditions
pt: Leia nossos termos
th: อ่านข้อกำหนดของเรา
vi: Đọc điều khoản của chúng tôi

# settingsPrivacyPolicy
source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité
pt: Política de privacidade
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật

# settingsPrivacyPolicySubtitle
source: Read our privacy policy
es: Lee nuestra política de privacidad
fr: Lire notre politique de confidentialité
pt: Leia nossa política de privacidade
th: อ่านนโยบายความเป็นส่วนตัวของเรา
vi: Đọc chính sách bảo mật của chúng tôi

# settingsSignOut
source: Sign Out
es: Cerrar sesión
fr: Se déconnecter
pt: Sair
th: ออกจากระบบ
vi: Đăng xuất

# settingsTapToChangeAvatar
source: Tap to change avatar
es: Toca para cambiar avatar
fr: Appuyez pour changer d'avatar
pt: Toque para alterar o avatar
th: แตะเพื่อเปลี่ยนรูปโปรไฟล์
vi: Chạm để thay đổi ảnh đại diện

# settingsDisplayName
source: Display Name
es: Nombre para mostrar
fr: Nom d'affichage
pt: Nome de exibição
th: ชื่อที่แสดง
vi: Tên hiển thị

# settingsEmail
source: Email
es: Correo electrónico
th: อีเมล

# settingsNotAvailable
source: Not available
es: No disponible
fr: Non disponible
pt: Não disponível
th: ไม่พร้อมใช้งาน
vi: Không khả dụng

# settingsSignInMethod
source: Sign-in Method
es: Método de inicio de sesión
fr: Méthode de connexion
pt: Método de login
th: วิธีการเข้าสู่ระบบ
vi: Phương thức đăng nhập

# settingsChooseAvatar
source: Choose Avatar
es: Elegir avatar
fr: Choisir un avatar
pt: Escolher avatar
th: เลือกรูปโปรไฟล์
vi: Chọn ảnh đại diện

# settingsFailedToUpdateAvatar
source: Failed to update avatar
es: Error al actualizar avatar
fr: Échec de la mise à jour de l'avatar
pt: Falha ao atualizar o avatar
th: อัปเดตรูปโปรไฟล์ไม่สำเร็จ
vi: Không thể cập nhật ảnh đại diện

# settingsEditDisplayName
source: Edit Display Name
es: Editar nombre para mostrar
fr: Modifier le nom d'affichage
pt: Editar nome de exibição
th: แก้ไขชื่อที่แสดง
vi: Chỉnh sửa tên hiển thị

# settingsEnterYourName
source: Enter your name
es: Ingresa tu nombre
fr: Entrez votre nom
pt: Digite seu nome
th: ป้อนชื่อของคุณ
vi: Nhập tên của bạn

# settingsNameCannotBeEmpty
source: Name cannot be empty
es: El nombre no puede estar vacío
fr: Le nom ne peut pas être vide
pt: O nome não pode estar vazio
th: ชื่อต้องไม่ว่างเปล่า
vi: Tên không được để trống

# settingsFailedToUpdateName
source: Failed to update name
es: Error al actualizar nombre
fr: Échec de la mise à jour du nom
pt: Falha ao atualizar o nome
th: อัปเดตชื่อไม่สำเร็จ
vi: Không thể cập nhật tên

# settingsAuthProviderEmail
source: Email
es: Correo electrónico
th: อีเมล

# settingsAuthProviderUnknown
source: Unknown
es: Desconocido
fr: Inconnu
pt: Desconhecido
th: ไม่ทราบ
vi: Không xác định

# settingsNotificationsDescription
source: Apothy respects your attention. No manipulation, no spam.
es: Apothy respeta tu atención. Sin manipulación, sin spam.
fr: Apothy respecte votre attention. Pas de manipulation, pas de spam.
pt: Apothy respeita sua atenção. Sem manipulação, sem spam.
th: Apothy เคารพความสนใจของคุณ ไม่มีการบังคับหรือสแปม
vi: Apothy tôn trọng sự chú ý của bạn. Không có thao túng, không có spam.

# settingsDailyMirrorRitual
source: Daily Mirror Ritual
es: Ritual del espejo diario
fr: Rituel du miroir quotidien
pt: Ritual do espelho diário
th: พิธีกรรมกระจกประจำวัน
vi: Nghi thức Gương hàng ngày

# settingsDailyMirrorRitualDescription
source: A gentle reminder when your daily mirror is ready
es: Un recordatorio suave cuando tu espejo diario esté listo
fr: Un rappel doux quand votre miroir quotidien est prêt
pt: Um lembrete gentil quando seu espelho diário estiver pronto
th: การเตือนอ่อนๆ เมื่อกระจกประจำวันของคุณพร้อม
vi: Lời nhắc nhẹ nhàng khi gương hàng ngày của bạn đã sẵn sàng

# settingsCreationComplete
source: Creation Complete
es: Creación completada
fr: Création terminée
pt: Criação concluída
th: การสร้างเสร็จสมบูรณ์
vi: Hoàn thành sáng tạo

# settingsCreationCompleteDescription
source: Know when long-form creations (videos, games) are ready
es: Saber cuándo las creaciones extensas (videos, juegos) están listas
fr: Savoir quand les créations longues (vidéos, jeux) sont prêtes
pt: Saiba quando criações longas (vídeos, jogos) estiverem prontas
th: แจ้งเมื่อการสร้างแบบยาว (วิดีโอ, เกม) พร้อม
vi: Biết khi nào các tác phẩm dài (video, trò chơi) đã sẵn sàng

# settingsMoodHealthInsights
source: Mood & Health Insights
es: Perspectivas de estado de ánimo y salud
fr: Aperçus humeur et santé
pt: Insights de humor e saúde
th: ข้อมูลเชิงลึกด้านอารมณ์และสุขภาพ
vi: Thông tin về tâm trạng & sức khỏe

# settingsMoodHealthInsightsDescription
source: Stress patterns, sleep correlations, ritual streaks
es: Patrones de estrés, correlaciones de sueño, rachas rituales
fr: Schémas de stress, corrélations de sommeil, séries rituelles
pt: Padrões de estresse, correlações de sono, sequências de rituais
th: รูปแบบความเครียด ความสัมพันธ์กับการนอนหลับ ชุดพิธีกรรม
vi: Mô hình căng thẳng, tương quan giấc ngủ, chuỗi nghi thức

# settingsMoodHealthInsightsExample
source: Optional wellness insights based on your usage
es: Perspectivas de bienestar opcionales basadas en tu uso
fr: Aperçus de bien-être optionnels basés sur votre utilisation
pt: Insights de bem-estar opcionais baseados no seu uso
th: ข้อมูลเชิงลึกด้านสุขภาพเสริมตามการใช้งานของคุณ
vi: Thông tin về sức khỏe tùy chọn dựa trên việc sử dụng của bạn

# settingsSystemUpdates
source: System Updates
es: Actualizaciones del sistema
fr: Mises à jour système
pt: Atualizações do sistema
th: การอัปเดตระบบ
vi: Cập nhật hệ thống

# settingsSystemUpdatesDescription
source: Security patches and new features
es: Parches de seguridad y nuevas funciones
fr: Correctifs de sécurité et nouvelles fonctionnalités
pt: Patches de segurança e novos recursos
th: แพตช์ความปลอดภัยและฟีเจอร์ใหม่
vi: Bản vá bảo mật và tính năng mới

# settingsSystemUpdatesExample
source: Required for App Store compliance
es: Requerido para cumplimiento de App Store
fr: Requis pour la conformité App Store
pt: Necessário para conformidade com a App Store
th: จำเป็นสำหรับการปฏิบัติตาม App Store
vi: Bắt buộc để tuân thủ App Store

# settingsThemeDialogMessage
source: Apothy currently supports dark mode only. Light mode and additional themes may be added in future updates.
es: Apothy actualmente solo admite modo oscuro. El modo claro y temas adicionales pueden agregarse en futuras actualizaciones.
fr: Apothy ne prend actuellement en charge que le mode sombre. Le mode clair et les thèmes supplémentaires pourront être ajoutés dans les futures mises à jour.
pt: Apothy atualmente suporta apenas o modo escuro. Modo claro e temas adicionais podem ser adicionados em atualizações futuras.
th: Apothy รองรับโหมดมืดเท่านั้นในขณะนี้ โหมดสว่างและธีมเพิ่มเติมอาจเพิ่มในอนาคต
vi: Apothy hiện chỉ hỗ trợ chế độ tối. Chế độ sáng và các chủ đề bổ sung có thể được thêm vào trong các bản cập nhật tương lai.

# settingsChooseTextSize
source: Choose your preferred text size
es: Elige tu tamaño de texto preferido
fr: Choisissez votre taille de texte préférée
pt: Escolha seu tamanho de texto preferido
th: เลือกขนาดตัวอักษรที่คุณต้องการ
vi: Chọn kích thước chữ ưa thích của bạn

# settingsSystemDefault
source: System Default
es: Predeterminado del sistema
fr: Par défaut du système
pt: Padrão do sistema
th: ค่าเริ่มต้นของระบบ
vi: Mặc định hệ thống

# settingsUseDeviceLanguage
source: Use device language
es: Usar idioma del dispositivo
fr: Utiliser la langue de l'appareil
pt: Usar idioma do dispositivo
th: ใช้ภาษาของอุปกรณ์
vi: Sử dụng ngôn ngữ thiết bị

# settingsChooseLanguage
source: Choose your preferred language
es: Elige tu idioma preferido
fr: Choisissez votre langue préférée
pt: Escolha seu idioma preferido
th: เลือกภาษาที่คุณต้องการ
vi: Chọn ngôn ngữ ưa thích của bạn

# settingsContentPreferencesDescription
source: Customize how Apotheon communicates with you.
es: Personaliza cómo Apotheon se comunica contigo.
fr: Personnalisez comment Apotheon communique avec vous.
pt: Personalize como Apotheon se comunica com você.
th: ปรับแต่งวิธีที่ Apotheon สื่อสารกับคุณ
vi: Tùy chỉnh cách Apotheon giao tiếp với bạn.

# settingsCreativeStyle
source: Creative Style
es: Estilo creativo
fr: Style créatif
pt: Estilo criativo
th: รูปแบบการสร้างสรรค์
vi: Phong cách sáng tạo

# settingsCreativeStyleDescription
source: Choose how Apotheon responds to you
es: Elige cómo Apotheon te responde
fr: Choisissez comment Apotheon vous répond
pt: Escolha como Apotheon responde a você
th: เลือกวิธีที่ Apotheon ตอบสนองคุณ
vi: Chọn cách Apotheon phản hồi bạn

# settingsMatureContent
source: Mature Content
es: Contenido para adultos
fr: Contenu pour adultes
pt: Conteúdo adulto
th: เนื้อหาสำหรับผู้ใหญ่
vi: Nội dung người lớn

# settingsMatureContentDescription
source: Allow adult themes in responses
es: Permitir temas para adultos en las respuestas
fr: Autoriser les thèmes pour adultes dans les réponses
pt: Permitir temas adultos nas respostas
th: อนุญาตธีมสำหรับผู้ใหญ่ในการตอบกลับ
vi: Cho phép chủ đề người lớn trong phản hồi

# settingsMatureContentEnabled
source: Adult themes enabled. Use responsibly.
es: Temas para adultos activados. Usa con responsabilidad.
fr: Thèmes pour adultes activés. Utilisez de manière responsable.
pt: Temas adultos ativados. Use com responsabilidade.
th: เปิดใช้งานธีมสำหรับผู้ใหญ่ ใช้อย่างรับผิดชอบ
vi: Chủ đề người lớn đã bật. Sử dụng có trách nhiệm.

# settingsMatureContentDisabled
source: Safe for work (SFW) - Default
es: Seguro para el trabajo (SFW) - Predeterminado
fr: Sûr pour le travail (SFW) - Par défaut
pt: Seguro para o trabalho (SFW) - Padrão
th: ปลอดภัยสำหรับงาน (SFW) - ค่าเริ่มต้น
vi: An toàn cho công việc (SFW) - Mặc định

# settingsPrivacyDialogMessage
source: Your data is stored securely on your device. Conversations are processed to provide personalized responses but are never sold or shared with third parties. You can delete your data at any time using the "Clear Data" option.
es: Tus datos se almacenan de forma segura en tu dispositivo. Las conversaciones se procesan para proporcionar respuestas personalizadas, pero nunca se venden ni comparten con terceros. Puedes eliminar tus datos en cualquier momento usando la opción "Borrar datos".
fr: Vos données sont stockées en toute sécurité sur votre appareil. Les conversations sont traitées pour fournir des réponses personnalisées, mais ne sont jamais vendues ni partagées avec des tiers. Vous pouvez supprimer vos données à tout moment en utilisant l'option "Effacer les données".
pt: Seus dados são armazenados com segurança em seu dispositivo. As conversas são processadas para fornecer respostas personalizadas, mas nunca são vendidas ou compartilhadas com terceiros. Você pode excluir seus dados a qualquer momento usando a opção "Limpar dados".
th: ข้อมูลของคุณถูกจัดเก็บอย่างปลอดภัยบนอุปกรณ์ของคุณ บทสนทนาถูกประมวลผลเพื่อให้การตอบกลับที่เป็นส่วนตัว แต่จะไม่ถูกขายหรือแบ่งปันกับบุคคลที่สาม คุณสามารถลบข้อมูลของคุณได้ตลอดเวลาโดยใช้ตัวเลือก "ล้างข้อมูล"
vi: Dữ liệu của bạn được lưu trữ an toàn trên thiết bị của bạn. Các cuộc trò chuyện được xử lý để cung cấp phản hồi cá nhân hóa nhưng không bao giờ được bán hoặc chia sẻ với bên thứ ba. Bạn có thể xóa dữ liệu của mình bất cứ lúc nào bằng tùy chọn "Xóa dữ liệu".

# settingsClearChatHistoryDialogTitle
source: Clear Chat History
es: Borrar historial de chat
fr: Effacer l'historique des conversations
pt: Limpar histórico de conversas
th: ล้างประวัติการสนทนา
vi: Xóa lịch sử trò chuyện

# settingsClearChatHistoryDialogMessage
source: This will delete:
es: Esto eliminará:
fr: Cela supprimera :
pt: Isso excluirá:
th: สิ่งนี้จะลบ:
vi: Điều này sẽ xóa:

# settingsClearChatHistoryItem1
source: • All chat conversations
es: • Todas las conversaciones de chat
fr: • Toutes les conversations de chat
pt: • Todas as conversas do chat
th: • บทสนทนาทั้งหมด
vi: • Tất cả các cuộc trò chuyện

# settingsClearChatHistoryItem2
source: • Conversation memory and context
es: • Memoria y contexto de conversaciones
fr: • Mémoire et contexte des conversations
pt: • Memória e contexto das conversas
th: • ความทรงจำและบริบทของบทสนทนา
vi: • Bộ nhớ và ngữ cảnh cuộc trò chuyện

# settingsClearChatHistoryItem3
source: • Chat-related preferences
es: • Preferencias relacionadas con el chat
fr: • Préférences liées au chat
pt: • Preferências relacionadas ao chat
th: • การตั้งค่าที่เกี่ยวข้องกับการสนทนา
vi: • Tùy chọn liên quan đến trò chuyện

# settingsClearChatHistoryNote
source: Your account, settings, and any exported files will not be affected.
es: Tu cuenta, configuración y archivos exportados no se verán afectados.
fr: Votre compte, paramètres et fichiers exportés ne seront pas affectés.
pt: Sua conta, configurações e arquivos exportados não serão afetados.
th: บัญชี การตั้งค่า และไฟล์ที่ส่งออกของคุณจะไม่ได้รับผลกระทบ
vi: Tài khoản, cài đặt và bất kỳ tệp đã xuất nào của bạn sẽ không bị ảnh hưởng.

# settingsClearChatHistorySuccess
source: Chat history cleared
es: Historial de chat borrado
fr: Historique des conversations effacé
pt: Histórico de conversas limpo
th: ล้างประวัติการสนทนาแล้ว
vi: Đã xóa lịch sử trò chuyện

# settingsClearChatHistoryFailed
source: Failed to clear chat history
es: Error al borrar historial de chat
fr: Échec de l'effacement de l'historique des conversations
pt: Falha ao limpar histórico de conversas
th: ล้างประวัติการสนทนาไม่สำเร็จ
vi: Không thể xóa lịch sử trò chuyện

# settingsClearHistoryButton
source: Clear History
es: Borrar historial
fr: Effacer l'historique
pt: Limpar histórico
th: ล้างประวัติ
vi: Xóa lịch sử

# settingsAdvancedDataManagement
source: Advanced Data Management
es: Gestión avanzada de datos
fr: Gestion avancée des données
pt: Gerenciamento avançado de dados
th: การจัดการข้อมูลขั้นสูง
vi: Quản lý dữ liệu nâng cao

# settingsAdvancedWarning
source: These actions are irreversible.
es: Estas acciones son irreversibles.
fr: Ces actions sont irréversibles.
pt: Essas ações são irreversíveis.
th: การดำเนินการเหล่านี้ไม่สามารถย้อนกลับได้
vi: Các hành động này không thể hoàn tác.

# settingsResetToFreshState
source: Reset to Fresh State
es: Restablecer a estado inicial
fr: Réinitialiser à l'état initial
pt: Redefinir para o estado inicial
th: รีเซ็ตให้เป็นสถานะใหม่
vi: Đặt lại về trạng thái ban đầu

# settingsResetDescription
source: This will erase ALL local data and reset the app to its initial state, as if you just installed it.
es: Esto borrará TODOS los datos locales y restablecerá la aplicación a su estado inicial, como si acabaras de instalarla.
fr: Cela effacera TOUTES les données locales et réinitialisera l'application à son état initial, comme si vous veniez de l'installer.
pt: Isso apagará TODOS os dados locais e redefinirá o aplicativo para seu estado inicial, como se você acabasse de instalá-lo.
th: สิ่งนี้จะลบข้อมูลในเครื่องทั้งหมดและรีเซ็ตแอปให้เป็นสถานะเริ่มต้น เหมือนคุณเพิ่งติดตั้ง
vi: Điều này sẽ xóa TẤT CẢ dữ liệu cục bộ và đặt lại ứng dụng về trạng thái ban đầu, như thể bạn vừa cài đặt nó.

# settingsResetWhatGetsCleared
source: What gets cleared: • All conversations and chat history • Account credentials (you'll need to sign in again) • All settings and preferences • Emotion challenge history • Any cached data
es: Lo que se borrará: • Todas las conversaciones e historial de chat • Credenciales de cuenta (deberás iniciar sesión nuevamente) • Todas las configuraciones y preferencias • Historial del desafío emocional • Todos los datos en caché
fr: Ce qui sera effacé : • Toutes les conversations et l'historique de chat • Identifiants de compte (vous devrez vous reconnecter) • Tous les paramètres et préférences • Historique du défi émotionnel • Toutes les données en cache
pt: O que será apagado: • Todas as conversas e histórico de chat • Credenciais da conta (você precisará fazer login novamente) • Todas as configurações e preferências • Histórico do desafio emocional • Todos os dados em cache
th: สิ่งที่จะถูกล้าง: • บทสนทนาและประวัติการสนทนาทั้งหมด • ข้อมูลประจำตัวบัญชี (คุณจะต้องเข้าสู่ระบบอีกครั้ง) • การตั้งค่าและความชอบทั้งหมด • ประวัติความท้าทายอารมณ์ • ข้อมูลแคชทั้งหมด
vi: Những gì sẽ bị xóa: • Tất cả các cuộc trò chuyện và lịch sử trò chuyện • Thông tin đăng nhập tài khoản (bạn sẽ cần đăng nhập lại) • Tất cả cài đặt và tùy chọn • Lịch sử thử thách cảm xúc • Tất cả dữ liệu đã lưu trong bộ nhớ cache

# settingsResetNote
source: Your cloud account and subscription remain intact.
es: Tu cuenta en la nube y suscripción permanecen intactas.
fr: Votre compte cloud et abonnement restent intacts.
pt: Sua conta na nuvem e assinatura permanecem intactas.
th: บัญชีคลาวด์และการสมัครสมาชิกของคุณยังคงอยู่
vi: Tài khoản đám mây và gói đăng ký của bạn vẫn nguyên vẹn.

# settingsResetAppButton
source: Reset App
es: Restablecer aplicación
fr: Réinitialiser l'application
pt: Redefinir aplicativo
th: รีเซ็ตแอป
vi: Đặt lại ứng dụng

# settingsResetConfirmTitle
source: Are you sure?
es: ¿Estás seguro?
fr: Êtes-vous sûr?
pt: Tem certeza?
th: คุณแน่ใจหรือไม่
vi: Bạn có chắc chắn?

# settingsResetConfirmMessage
source: Resetting will erase all local data. This cannot be undone. You will need to sign in again and complete onboarding.
es: Restablecer borrará todos los datos locales. Esto no se puede deshacer. Deberás iniciar sesión nuevamente y completar la incorporación.
fr: La réinitialisation effacera toutes les données locales. Cela ne peut pas être annulé. Vous devrez vous reconnecter et terminer l'intégration.
pt: Redefinir apagará todos os dados locais. Isso não pode ser desfeito. Você precisará fazer login novamente e concluir a integração.
th: การรีเซ็ตจะลบข้อมูลในเครื่องทั้งหมด ไม่สามารถย้อนกลับได้ คุณจะต้องเข้าสู่ระบบอีกครั้งและทำการเริ่มต้นใช้งาน
vi: Đặt lại sẽ xóa tất cả dữ liệu cục bộ. Điều này không thể hoàn tác. Bạn sẽ cần đăng nhập lại và hoàn tất quá trình giới thiệu.

# settingsResetFailed
source: Failed to reset app
es: Error al restablecer la aplicación
fr: Échec de la réinitialisation de l'application
pt: Falha ao redefinir o aplicativo
th: รีเซ็ตแอปไม่สำเร็จ
vi: Không thể đặt lại ứng dụng

# settingsResetEverythingButton
source: Reset Everything
es: Restablecer todo
fr: Tout réinitialiser
pt: Redefinir tudo
th: รีเซ็ตทุกอย่าง
vi: Đặt lại tất cả

# settingsDeleteAccountDialogMessage
source: This will permanently delete your account.
es: Esto eliminará permanentemente tu cuenta.
fr: Cela supprimera définitivement votre compte.
pt: Isso excluirá permanentemente sua conta.
th: สิ่งนี้จะลบบัญชีของคุณอย่างถาวร
vi: Điều này sẽ xóa vĩnh viễn tài khoản của bạn.

# settingsDeleteAccountWhatGetsDeleted
source: What gets deleted:
es: Lo que se eliminará:
fr: Ce qui sera supprimé :
pt: O que será excluído:
th: สิ่งที่จะถูกลบ:
vi: Những gì sẽ bị xóa:

# settingsDeleteAccountItem1
source: • Your Apothy account
es: • Tu cuenta de Apothy
fr: • Votre compte Apothy
pt: • Sua conta Apothy
th: • บัญชี Apothy ของคุณ
vi: • Tài khoản Apothy của bạn
